package Task3;



/*
Создать массив на 10 чисел. Заполнить его числами с клавиатуры. Вывести пять наибольших чисел.
*/


/*
Задача: Ввести с клавиатуры 5 слов и выведи их в алфавитном порядке.
*/


/*
Создать коллекцию HashMap<String, String>, занести туда 4 пары строк
Вывести содержимое коллекции на экран, каждый элемент с новой строки.
Пример вывода:
ключ - значение
ключ - значение
ключ - значение
ключ - значение
*/


/*
Есть коллекция HashMap<String, String>, туда занесли 3 различные пары.
При помощи метода printKeys:
Вывести на экран список ключей, каждый элемент с новой строки.
*/

/*
Есть коллекция HashMap<String, String>, туда занесли 3 различные пары.
При помощи метода printValues:
Вывести на экран список значений, каждый элемент с новой строки.
*/

/* Удалить все числа больше 10
Создать множество чисел(Set<Integer>), занести туда 5 различных чисел.
При помощи метода  removeAllNumbersMoreThan10 удалить из множества все числа больше 10.
*/



public class Task3 {
    public static void main(String[] args) {

    }
}
